# 01 Pandas(판다스)

In [1]:
import pandas as pd

market = pd.Series(index = ['Apple', 'Banana', 'Carrot'],
                   data = [12, 5, 2])
market

Apple     12
Banana     5
Carrot     2
dtype: int64

In [2]:
import pandas as pd # pandas 패키지를 파이썬으로 불러오기

# 하와이안 피자가 아닌 피자 만들기
pizza = pd.Series(index = ['bread', 'olive', 'shrimp', 'sausage', 'pineapple'],
                  data = [1, 8, 6, 12, 'No'])

# Pandas Series
pizza

bread         1
olive         8
shrimp        6
sausage      12
pineapple    No
dtype: object

In [3]:
pizza.index

Index(['bread', 'olive', 'shrimp', 'sausage', 'pineapple'], dtype='object')

In [4]:
# 필요한 새우의 개수
print(pizza['shrimp'])

6

In [5]:
print(pizza[['olive', 'sausage']])

olive       8
sausage    12
dtype: object

In [6]:
print(pizza.loc[['olive', 'sausage']])

olive       8
sausage    12
dtype: object

In [7]:
# 필요한 새우와 소세지의 수
print(pizza.iloc[[2,3]])

shrimp      6
sausage    12
dtype: object

In [8]:
# 해당 인덱스에 value를 덮어 씌워 준다.
pizza['shrimp'] = 12

pizza

bread         1
olive         8
shrimp       12
sausage      12
pineapple    No
dtype: object

In [9]:
pizza.drop('pineapple', inplace=True)

pizza

bread       1
olive       8
shrimp     12
sausage    12
dtype: object

In [10]:
# pandas 패키지 불러오기
import pandas as pd

# 데이터를 딕셔너리로 정의
data = {
    '이름' : ['Alice', 'Bob', 'Charlie', 'David'],
    '나이' : [25, 30, 22, 28],
    '국적' : ['미국', '영국', '영국', '미국']
}

df = pd.DataFrame(data, index = ['학생1', '학생2', '학생3', '학생4'])

df

          이름  나이  국적
학생1    Alice  25  미국
학생2      Bob  30  영국
학생3  Charlie  22  영국
학생4    David  28  미국

In [11]:
# Value
df.values

array([['Alice', 25, '미국'],
       ['Bob', 30, '영국'],
       ['Charlie', 22, '영국'],
       ['David', 28, '미국']], dtype=object)

In [12]:
df.columns

Index(['이름', '나이', '국적'], dtype='object')

In [13]:
name = pd.DataFrame(df, columns = ['이름'])
print(name)

          이름
학생1    Alice
학생2      Bob
학생3  Charlie
학생4    David

In [14]:
who = df[['이름', '나이']]
print(who)

          이름  나이
학생1    Alice  25
학생2      Bob  30
학생3  Charlie  22
학생4    David  28

In [15]:
df.index

Index(['학생1', '학생2', '학생3', '학생4'], dtype='object')

In [16]:
Alice = pd.DataFrame(df, index = ['학생1'])
print(Alice)

        이름  나이  국적
학생1  Alice  25  미국

In [17]:
students = df.iloc[2]
print(students)

이름    Charlie
나이         22
국적         영국
Name: 학생3, dtype: object

In [18]:
# 취미 정보 추가
hobbies = ['등산', '음악', '독서', '영화감상']
df['취미'] = hobbies

print(df)

          이름  나이  국적    취미
학생1    Alice  25  미국    등산
학생2      Bob  30  영국    음악
학생3  Charlie  22  영국    독서
학생4    David  28  미국  영화감상

In [19]:
# 기존 데이터프레임 재설정 (취미 생성 전)
df = pd.DataFrame(data, index = ['학생1', '학생2', '학생3', '학생4'])

# 'Elsa' 추가
new_student = {'이름' : 'Elsa', '나이' : 24, '국적' : '프랑스'}

df.loc['학생5'] = new_student
print(df)

          이름  나이   국적
학생1    Alice  25   미국
학생2      Bob  30   영국
학생3  Charlie  22   영국
학생4    David  28   미국
학생5     Elsa  24  프랑스

In [20]:
# 나이삭제
df.pop('나이')
df

          이름   국적
학생1    Alice   미국
학생2      Bob   영국
학생3  Charlie   영국
학생4    David   미국
학생5     Elsa  프랑스

In [21]:
import pandas as pd

# 새로운 자료
data = {
    '제품명' : ['사과', '바나나', '딸기', '포도'],
    '가격' : [1000, 1500, pd.NA, 2000],
    '수량' : [3, pd.NA, 2, 4]
}

# 데이터프레임 생성
shopping_df = pd.DataFrame(data)

print(shopping_df)

   제품명    가격    수량
0   사과  1000     3
1  바나나  1500  <NA>
2   딸기  <NA>     2
3   포도  2000     4

In [22]:
shopping_df.isnull()

     제품명     가격     수량
0  False  False  False
1  False  False   True
2  False   True  False
3  False  False  False

In [23]:
shopping_df.isnull().sum()

제품명    0
가격     1
수량     1
dtype: int64

In [24]:
# 0으로 대체
shopping_df_filled = shopping_df.fillna(0)

print(shopping_df_filled)

   제품명    가격  수량
0   사과  1000   3
1  바나나  1500   0
2   딸기     0   2
3   포도  2000   4

In [25]:
cleaned_df = shopping_df.dropna(axis = 0)

cleaned_df

  제품명    가격 수량
0  사과  1000  3
3  포도  2000  4

# 02 싸이킷런(scikit-learn)

In [26]:
import pandas as pd

titanic = pd.read_csv('titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,8.0500,S

In [27]:
# Feature (X)와 Target (Y) 분리
X = titanic.drop('Survived', axis=1)
Y = titanic['Survived']

print(X)
print(Y)

     PassengerId  Pclass                                               Name  \
0              1       3                            Braund, Mr. Owen Harris
1              2       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2              3       3                             Heikkinen, Miss. Laina
3              4       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4              5       3                           Allen, Mr. William Henry
..           ...     ...                                                ...
886          887       2                              Montvila, Rev. Juozas
887          888       1                       Graham, Miss. Margaret Edith
888          889       3           Johnston, Miss. Catherine Helen "Carrie"
889          890       1                              Behr, Mr. Karl Howell
890          891       3                                Dooley, Mr. Patrick

        Sex   Age  SibSp     Fare Embarked
0      male  22.0      1   7.2500        S
1    female  38.0      1  71.2833        C
2    female  26.0      0   7.9250        S
3    female  35.0      1  53.1000        S
4      male  35.0      0   8.0500        S
..      ...   ...    ...      ...      ...
886    male  27.0      0  13.0000        S
887  female  19.0      0  30.0000        S
888  female   NaN      1  23.4500        S
889    male  26.0      0  30.0000        C
890    male  32.0      0   7.7500        Q

[891 rows x 8 columns]
0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [28]:
# 성별 열의 고유값 확인
unique_genders = titanic['Sex'].unique()
print("성별 값:", unique_genders)

성별 값: ['male' 'female']

In [29]:
# 객실 클래스 열의 고유한 값 개수 확인
unique_class_count = titanic['Pclass'].nunique()
print("객실 고유 개수:", unique_class_count)

객실 고유 개수: 3

In [30]:
from sklearn.preprocessing import LabelEncoder

# LabelEncoder 객체 생성
le = LabelEncoder()

# 'Sex' 열을 라벨 인코딩하여 덮어씌우기
titanic['Sex'] = le.fit_transform(titanic['Sex'])

titanic['Sex']

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: Sex, Length: 891, dtype: int64

In [31]:
# 'Sex' 열을 원-핫 인코딩하여 새로운 열들로 추가
encoded_sex = pd.get_dummies(titanic['Sex'], prefix='Sex')
titanic = pd.concat([titanic, encoded_sex], axis=1)

# 'Sex' 열 제거
titanic.drop('Sex', axis=1, inplace=True)
titanic

,PassengerId,Survived,Pclass,Name,Age,SibSp,Fare,Embarked,Sex_0,Sex_1
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,7.2500,S,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,71.2833,C,True,False
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,7.9250,S,True,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,53.1000,S,True,False
4,5,0,3,"Allen, Mr. William Henry",35.0,0,8.0500,S,False,True
...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",27.0,0,13.0000,S,False,True
887,888,1,1,"Graham, Miss. Margaret Edith",19.0,0,30.0000,S,True,False
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,1,23.4500,S,True,False
889,890,1,1,"Behr, Mr. Karl Howell",26.0,0,30.0000,C,False,True
890,891,0,3,"Dooley, Mr. Patrick",32.0,0,7.7500,Q,False,True

In [37]:
from sklearn.model_selection import train_test_split

# 예시 데이터
x = [[0.1, 0.2], [0.3, 0.4], [0.5, 0.6], [0.7, 0.8]]
y = [0, 1, 0, 1]

# Train과 Test 데이터로 분리
X_train, X_test, Y_train, Y_test = train_test_split(x, y, test_size = 0.2, random_state=42)

print("x_train:", X_train)
print("x_test", X_test)
print("y_train", Y_train)
print("y_test", Y_test)

x_train: [[0.7, 0.8], [0.1, 0.2], [0.5, 0.6]]
x_test [[0.3, 0.4]]
y_train [1, 0, 0]
y_test [1]

In [39]:
from sklearn.model_selection import train_test_split

# Train과 Test 데이터로 분리
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.2, random_state=42)

print("X_train shape:", X_train.shape)
print("X_test shape:", X_test.shape)
print("Y_train shape:", Y_train.shape)
print("Y_test shape:", Y_test.shape)

X_train shape: (712, 8)
X_test shape: (179, 8)
Y_train shape: (712,)
Y_test shape: (179,)